# Решение контрольной работы по итогу первого блока.

## Задача

```
Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

Примеры:
[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
[“1234”, “1567”, “-2”, “computer science”] → [“-2”]
[“Russia”, “Denmark”, “Kazan”] → []
```

## Решение

Для решения задачи необходимо разделить задачу на более мелкие подзадачи:

1. Необходимо узнать количество элементов в новом массиве подходящих под условие задачи;
2. Инициализация нового массива для подходящих элементов;
3. Копирование подходящих элементов из основного массива согласно условиям задачи в новый массив;
4. Вывод массива на экран.

## Описание решения в коде C#

Создаем функцию, которая вернет нам массив с подходящими по условию задачи элементами:
```
string[] GetNewStringArray(string[] arrStr)
```

Внутри функции производим подсчет элементов нового массива используя цикл *for* и записываем результат в отдельную переменную *счетчик*.

```
int count = 0;
for (int i = 0; i < arrStr.Length; i++)
{
    if(arrStr[i].Length <= 3)
    {
        count++;
    }
}
```
Далее инициализируем новый массив.
```
string[] result = new string[count];
```

Вносим в новый массив элементы подходящий под условие задачи и возвращаем результат:

```
for (int i = 0; i < arrStr.Length; i++)
{
    if(arrStr[i].Length <= 3)
    {
        result[j] = arrStr[i];
        j++;
    }
}
return result;
```

Создаем отдельную функцию для вывода массива:

```
void PrintArray(string[] strArray)
{
    Console.Write("[");
    for (int i = 0; i < strArray.Length; i++)
    {
        Console.Write($"'{strArray[i]}' ");
    }
    Console.Write("]");
}
```

